export default function ZanaBazar({letter}) {
    
    // const bazar = '𑨝𑨋𑨰𑩇𑨪𑨊𑨞𑨁𑨭𑩇𑨪𑨋𑩇𑨙𑨁𑨍𑨙𑨄𑨞𑨊𑨫𑨁𑨭𑨊𑨫𑨁𑨋𑨄𑨐𑨒𑨁𑨊𑨭𑨝𑨄𑨍𑩇𑨫𑨉𑨱𑨄𑨞𑨙𑩇𑨫𑨭𑩇𑨪𑨭𑨱𑨊𑨫𑨄𑨐𑨰𑩇𑨭𑨄𑨐𑩇𑨑𑨪𑨊𑨱𑨰𑩇𑨙𑨲𑨄𑨞𑨆𑨝𑨂𑨒𑩇𑨓𑨊𑨰𑩇𑨪𑨙𑨄𑨝𑨭𑨊𑨋𑨰𑩇𑨪𑨊𑨞𑨁𑨌𑩇𑨪𑨊𑨙𑨁𑨸𑨰𑨢𑩇𑨢𑨊𑨝𑨸𑨭𑨊𑨋𑩇𑨫𑨊𑨝𑩇𑨙𑨂𑨸𑨋𑨆𑨞𑨁𑨮𑨲𑩇𑨪𑨙𑨁𑩂𑨀𑨄𑨙𑨊𑨱𑨋𑨴𑨱𑨰𑩇𑨙𑨲𑨄𑨞𑨊𑨋𑩇𑨫𑨢𑨘𑨊𑨝𑨁𑨭𑨁𑨫𑨂𑨜𑩇𑨪𑨞𑩇𑨫𑨙𑩇𑨪𑨄𑨋𑨢𑨞𑨁𑨒𑨝𑨹𑨭𑨁𑨜𑨁𑨰𑨸𑨫𑨲𑨘𑨸𑨰𑨸𑨜𑨙𑩇𑨙𑨄𑩂𑨞𑩇𑨫𑨙𑩇𑨪𑨄𑨋𑨢𑨞𑨁𑨭𑨁𑨐𑨊𑨫𑨊𑨘𑨊𑨸𑨐𑨄𑨙𑨝𑨊𑨪𑨊𑨹𑨜𑨫𑩇𑨢𑨰𑩇𑨪𑨐𑨰𑩇𑨭𑨊𑨙𑨝𑩇𑨙𑩇𑨫𑩇𑨪𑨊𑨜𑨁𑨋𑨊𑨫𑨸𑨰𑨸𑨜𑨙𑩇𑨙𑨄𑩂𑨀𑨰𑩇𑨢𑨁𑨝𑨴𑨀𑨜𑨁𑨋𑨊𑨫𑨄𑨰𑩇𑨭𑨁𑨊𑨪𑨜𑨫𑩇𑨢𑨸𑨭𑨁𑨮𑩇𑨭𑨊𑨰𑨸𑨭𑨊𑨮𑨁𑨲𑨪𑨁𑨙𑨂𑨸𑨀𑨡𑩇𑨪𑨰𑩇𑨙𑨂𑨸𑨀𑨫𑩇𑨐𑨁𑨙𑨂𑨸𑨞𑨫𑨁𑨞𑨊𑨬𑨪𑨁𑨙𑨂𑨸𑨭𑨊𑨭𑨄𑨊𑨪𑨋𑩇𑨙𑨁𑨋𑨄𑨰𑨊𑨢𑨊𑨒𑨁𑨋𑨄𑨐𑨒𑨁𑨊𑨭𑨝𑨄𑨀𑨝𑩇𑨪𑨄𑨊𑨮𑩇𑨐𑨰𑨱𑨰𑨊𑨢𑨂𑨛𑨊𑨪𑨁𑨋𑨒𑨁𑨊𑨭𑨝𑨄𑨀𑨄𑨋𑨊𑨋𑨁𑨝𑨊𑨭𑨊𑨰𑩇𑨭𑨁𑨊𑨪𑨸𑨜𑨫𑩇𑨢𑨸𑨭𑨁𑨮𑩇𑨭𑨊𑨰𑨸𑨰𑩇𑨭𑨊𑨙𑨝𑩇𑨙𑩇𑨫𑩇𑨪𑨸𑨐𑨞𑨫𑨁𑨭𑨫𑩇𑨙𑨪𑨁𑨙𑨂𑨢𑨞𑨁𑨞𑩇𑨫𑨙𑩇𑨪𑨄𑨋𑨸𑨒𑨝𑨹𑨰𑩇𑨭𑨊𑨙𑨝𑩇𑨙𑩇𑨫𑩇𑨪𑨸𑨜𑨊𑨫𑨪𑨙𑨁𑩂𑨋𑨊𑨫𑩇𑨪𑨱𑨆𑨫𑨊𑨘𑨊𑨸𑨰𑨢𑨂𑨐𑨁𑨙𑨝𑨁𑨪𑨢𑨝𑨞𑨂𑨫𑨰𑩇𑨰𑨫𑨢𑨴𑨰𑨭𑨄𑨙𑨝𑨸𑨐𑨝𑨁𑨪𑨙𑨊𑨭𑨜𑨁𑨋𑨊𑨭𑨋𑨊𑨮𑨄𑨝𑨰𑨱𑨭𑨁𑨮𑩇𑨫𑨢𑨊𑨜𑨁𑨋𑨊𑨫𑨹𑨞𑩇𑨫𑨙𑩇𑨪𑨋𑨰𑩇𑨢𑨄𑨊𑨞𑩇𑨫𑨛𑨄𑨪𑨆𑨰𑩇𑨙𑨁𑩂';
   
    const bazarArray = [
        '𑨝',
        '𑨋',
        '𑨰𑩇𑨪𑨊',
        '𑨭',
        '𑨍',
        '𑨫𑨁',
        '𑨭',
        '𑨙𑨄',
        '𑨫𑨉',
        '𑨐',
        '𑨪𑨊',
        '𑨮'
    ];

    if (letter > 12){
        return(
            <span style={{color:'crimson'}}>{letter}</span>
        )
    };

    return (
        <span>{bazarArray[letter]}</span>
    );

}